trade_exp/src/Documents/ОтчетБанкаПоОперациямЭквайринга/ОтчетБанкаПоОперациямЭквайринга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="10cefb2f-fb51-481f-87d1-cb8d023dd564">
  <name>ОтчетБанкаПоОперациямЭквайринга</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b2553dfb-7e2a-402e-a246-8b328c879c17">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5bca6447-317d-42fd-b105-9ed9ae65c2dc">
    <name>СуммаПокупок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="86ff899f-9d9c-473f-93a9-573d77f626fb">
    <name>СуммаВозвратов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="8dbd1654-46bc-4b52-91fc-e73f1aaa3649">
    <name>Покупки</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ДанныеБезналичныхОплат/ДанныеБезналичныхОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c3db7f2b-6046-4767-a8e0-5431ea1f8e26">
  <name>ДанныеБезналичныхОплат</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="298e0de6-3a02-4703-8f53-df3a8f85d7c6">
    <name>ДокументОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="76496f61-091c-428f-a918-1ecd5056e823">
    <name>IDТранзакции</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="d07670eb-922b-445d-afdc-27fbd65f46fc">
    <name>СБП</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="994ecf6c-34a9-4274-952e-8a44959ddd3d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>ОтложенБезРезервирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ОтложенСРезервированием</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ОперацияПоПлатежнойКарте/ОперацияПоПлатежнойКарте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОперацияПоПлатежнойКарте</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КодАвторизации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭквайринговыйТерминал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерПлатежнойКарты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>22</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="519f7081-fbb2-4e09-b49f-933cd57fe47b">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2bd26061-21f8-477c-a020-950c3ff9e7ec">
    <name>ДеньгиВнесеныCотрудником</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9a4faab9-0d8e-4f9d-92a2-d5dad0978e3f">
    <name>СотрудникВнесшийДеньги</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="32212b4a-8193-4934-ba95-d3ed10bd7e8b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ecc4eb3a-88e5-486f-a05e-f6c046cadcf8">
    <name>ДоговорЭквайринга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="16dfe378-fa95-4582-8aa7-ded2305d30d3">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8034211b-1cf9-4a82-967b-6602bfaae416">
    <name>СуммаКомиссии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a1e13273-a58d-4cf1-9c0e-0b9661124521">
    <name>СтатьяРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fef872a-3dcd-4c7f-a523-c3fda7f49b31">
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6e9692b3-ee83-4533-81cd-7e8c35d1092e">
    <name>НомерЧекаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6f39ab37-410a-4b78-a50b-d5c2129ecc65">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОснованиеПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dc1fbe56-8f5d-46b8-baa2-14741212b2bf">
      <name>КурсЧислительВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="855c6534-ffa9-4192-93d5-baabbf4e3f5d">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ОтчетБанкаПоОперациямЭквайринга/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Док_ПослеЗаписиПосле (ПараметрыЗаписи)
	МассивЧеков = НайтиЧекиБезИД();
	
	Если МассивЧеков.Количество() > 0 Тогда   
		Режим = РежимДиалогаВопрос.ДаНет;
		
		Ответ = Вопрос("Есть незаполненные ИД транзакции, заполнить?", Режим, 0);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Для ин = 0 По МассивЧеков.Вграница() Цикл
				СтрукЧека = МассивЧеков[ин];
				АльтерраОбщегоНазначенияКлиент.ИзвлечьIDТранзакции(СтрукЧека.Ссылка, СтрукЧека.Дата, СтрукЧека.Сумма);
			КонецЦикла;  
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере 

Функция НайтиЧекиБезИД()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ Различные
	|	ОтчетБанкаПоОперациямЭквайрингаПокупки.ЭквайринговыйТерминал КАК Терминал
	|ПОМЕСТИТЬ Терминалы
	|ИЗ
	|	Документ.ОтчетБанкаПоОперациямЭквайринга.Покупки КАК ОтчетБанкаПоОперациямЭквайрингаПокупки
	|ГДЕ
	|	ОтчетБанкаПоОперациямЭквайрингаПокупки.Ссылка = &Ссылка
	|  	И НЕ ОтчетБанкаПоОперациямЭквайрингаПокупки.ЭквайринговыйТерминал.Наименование ПОДОБНО ""%Доставк%""  
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМОплатаПлатежнымиКартами.Ссылка КАК Ссылка,
	|	ЧекККМОплатаПлатежнымиКартами.Сумма КАК Сумма,
	|	ЧекККМОплатаПлатежнымиКартами.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ЧекККМ.ОплатаПлатежнымиКартами КАК ЧекККМОплатаПлатежнымиКартами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеБезналичныхОплат КАК ДанныеБезналичныхОплат
	|		ПО ЧекККМОплатаПлатежнымиКартами.Ссылка = ДанныеБезналичныхОплат.ДокументОплаты
	|ГДЕ
	|	ЧекККМОплатаПлатежнымиКартами.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЧекККМОплатаПлатежнымиКартами.Ссылка.ПометкаУдаления = Ложь
	|	И ЧекККМОплатаПлатежнымиКартами.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И НЕ ЧекККМОплатаПлатежнымиКартами.Ссылка ЕСТЬ NULL
	|	И (ДанныеБезналичныхОплат.IDТранзакции ЕСТЬ NULL
	|			ИЛИ ДанныеБезналичныхОплат.IDТранзакции = ""ID not found""
	|			ИЛИ ДанныеБезналичныхОплат.IDТранзакции = ""Не найден лог"")
	|	И ЧекККМОплатаПлатежнымиКартами.ЭквайринговыйТерминал В
	|			(ВЫБРАТЬ
	|				Терминалы.Терминал КАК Терминал
	|			ИЗ
	|				Терминалы КАК Терминалы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОперацияПоПлатежнойКарте.Ссылка КАК Ссылка,
	|	ОперацияПоПлатежнойКарте.Дата КАК Дата, 
	|	ОперацияПоПлатежнойКарте.СуммаДокумента КАК Сумма
	|ИЗ
	|	Документ.ОперацияПоПлатежнойКарте КАК ОперацияПоПлатежнойКарте
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеБезналичныхОплат КАК ДанныеБезналичныхОплат
	|		ПО (ОперацияПоПлатежнойКарте.Ссылка = ДанныеБезналичныхОплат.ДокументОплаты)
	|ГДЕ 
	|    ОперацияПоПлатежнойКарте.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И  ОперацияПоПлатежнойКарте.ПометкаУдаления = Ложь
	|	И (ДанныеБезналичныхОплат.IDТранзакции ЕСТЬ NULL
	|			ИЛИ ДанныеБезналичныхОплат.IDТранзакции = ""ID not found""
	|			ИЛИ ДанныеБезналичныхОплат.IDТранзакции = ""Не найден лог"")
	|	И ОперацияПоПлатежнойКарте.ЭквайринговыйТерминал В
	|			(ВЫБРАТЬ
	|				Терминалы.Терминал КАК Терминал
	|			ИЗ
	|				Терминалы КАК Терминалы)"; 
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ТекущаяДата()));
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка1 = МассивРезультатов[1].Выбрать();                   
	Выборка2 = МассивРезультатов[2].Выбрать();                   

	МассивЧеков = Новый Массив();
	
	Если Выборка1.Количество() > 0 Тогда
		Пока Выборка1.Следующий() Цикл
			СтрукЧека = Новый Структура("Ссылка,Дата,Сумма");
			ЗаполнитьЗначенияСвойств(СтрукЧека,Выборка1);
			МассивЧеков.Добавить(СтрукЧека);
		КонецЦикла;
	КонецЕсли;   
	
	Если Выборка2.Количество() > 0 Тогда
		Пока Выборка2.Следующий() Цикл
			СтрукЧека = Новый Структура("Ссылка,Дата,Сумма");
			ЗаполнитьЗначенияСвойств(СтрукЧека,Выборка2);
			МассивЧеков.Добавить(СтрукЧека);
		КонецЦикла;
	КонецЕсли; 
	
	Возврат МассивЧеков;

	
	
КонецФункции
